import { createStore } from "redux";

const defaultState = [
  {
    id: "1",
    title: "Продається пиво львівське 0,7л",
    description:
      "Б/У, але надпилось лише раз, стан пляшки новий, є невеликі потертості (їх майже не видно), залишилось 0,6л, купляв для дитини, але їй ще немає 18(((",
    date: "9/04/2022, 12:35:21",
  },
  {
    id: "2",
    title: "Віддам в хороші руки танк",
    description:
      "Був виміняний в циганів на коня, бере 150л на 100 км, дороговато їздити в село...",
    date: "8/04/2022, 15:35:21",
  },
  {
    id: "3",
    title: "Швидке будівництво будівель різного призначення по всій Україні.",
    description:
      "Компанія ТСВ-БУД здійснює виробництво, доставку та монтаж швидкозбірних, збірно-розбірних споруд для тимчасового та постійного прибування. А також будівництво магазинів, торгових павільйонів, кафе, ресторанів, офісів будь-яких типів і розмірів, та інших за призначенням споруд по всій території України під ключ Ми відкриті в Києві та додатково відкрито філії виробництва в двох областях, Винницькій та Хмельницькій. У виробництві застосовується надійна та довговічна технологія ЛСТК (легкі сталеві оцинковані конструкції) надає нам ряд переваг",
    date: "8/04/2022, 16:35:21",
  },
  {
    id: "4",
    title: "Розборка автобусів NEOPLAN N 316,Mercedes 0404",
    description:
      "Продається автобус цілий чи на запчастини: панель приборів, бампер, дзеркало, скло переднє, скло заднє, двигун,кпп, задній міст, тощо В наявності комплектуючі до осей: супорти Haldex,Knorr Bremse, ступиці Saf та Bpw( маточина або в зборі з підшипником), амортизаторні і ресорні болти, амортизатори, тормозні колодки, тормозні камери, енергоакумулятори, листові ресори,тормозні диски,стрімянки. Двигун,КПП, задній міст без навісних та інші запчастини до Daf cf 65 і автобусу neoplan n 316. Колесні диски для легкових машин,тягачів і причіпів. Лапи опорні Jost. Грузові шини 385/65/22,5 Continental, Next Tread, Michelin, Aurora,Bandvulc і т.д. Також в наявності осі BPW, SAF без навісних та комплектуючі з ресорним листом,супортом,тормозним диском і т.д.",
    date: "8/04/2022, 17:35:21",
  },
  {
    id: "5",
    title: "Віддам танк",
    description:
      "Хотів постріляти, розвалив хату сусіда, треба бути обережним...",
    date: "8/04/2022, 15:35:21",
  },
  {
    id: "6",
    title: "Пиво чернігівське продаю",
    description: "Просрочене, але від нього навіть сильніший ефект",
    date: "8/04/2022, 15:35:24",
  },
  {
    id: "7",
    title: "Танк Т-34 згорівший",
    description:
      "Мав необережність їздити під байрактаром, на запчастини, торг присутній, або міняю на коня!",
    date: "8/04/2022, 15:35:24",
  },
];

const reducer = (state = defaultState, action) => {
  switch (action.type) {
    case "DELETE_CARD":
      return state.filter((item) => item.id !== action.id);
    case "EDIT_CARD":
      const newSate = state.map((item) => {
        if (item.id === action.id) {
          item.title = action.title;
          item.description = action.description;
        }
        return item;
      });

      return [...newSate];
    case "ADD_CARD":
      const newCardState = state.slice();
      const newCard = {
        id: Date.now(),
        date: action.date,
        title: action.title,
        description: action.description,
      };
      newCardState.unshift(newCard);

      return [...newCardState];

    default:
      return state;
  }
};

export const store = createStore(reducer);
